anthropic.claude-code
anysphere.cursorpyright
anysphere.remote-containers
batisteo.vscode-django
bmewburn.vscode-intelephense-client
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
eamodio.gitlens
kevinrose.vsc-python-indent
maosantaella.night-wolf
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
njpwerner.autodocstring
quarto.quarto
rdebugger.r-debugger
reditorsupport.r
reditorsupport.r-syntax
sdras.night-owl
shd101wyy.markdown-preview-enhanced
wesbos.theme-cobalt2
wholroyd.jinja
