amiralizadeh9480.laravel-extra-intellisense
ancientlord.nightowl-theme
anthropic.claude-code
anysphere.cursorpyright
batisteo.vscode-django
bmewburn.vscode-intelephense-client
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
dbaeumer.vscode-eslint
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
esbenp.prettier-vscode
kevinrose.vsc-python-indent
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
njpwerner.autodocstring
onecentlin.laravel-blade
quarto.quarto
rdebugger.r-debugger
reditorsupport.r
reditorsupport.r-syntax
shd101wyy.markdown-preview-enhanced
thedavej.night-owl-black
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wholroyd.jinja
